server/ruby/app/graphql/types/query_type.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def user(id:)
      User.find(id)